eepyminded/stm32-room-conditions-monitor/receiver_code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define diode_6_Pin GPIO_PIN_0
#define diode_6_GPIO_Port GPIOC
#define diode_5_Pin GPIO_PIN_1
#define diode_5_GPIO_Port GPIOC
#define diode_9_Pin GPIO_PIN_2
#define diode_9_GPIO_Port GPIOC
#define diode_10_Pin GPIO_PIN_3
#define diode_10_GPIO_Port GPIOC
#define diode_1_Pin GPIO_PIN_0
#define diode_1_GPIO_Port GPIOA
#define diode_2_Pin GPIO_PIN_1
#define diode_2_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define danger_3_Pin GPIO_PIN_5
#define danger_3_GPIO_Port GPIOA
#define diode_3_Pin GPIO_PIN_6
#define diode_3_GPIO_Port GPIOA
#define diode_4_Pin GPIO_PIN_0
#define diode_4_GPIO_Port GPIOB
#define diode_7_Pin GPIO_PIN_7
#define diode_7_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define diode_8_Pin GPIO_PIN_5
#define diode_8_GPIO_Port GPIOB
#define danger_1_Pin GPIO_PIN_8
#define danger_1_GPIO_Port GPIOB
#define danger_2_Pin GPIO_PIN_9
#define danger_2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
